app/Http/Controllers/OsAndServer/ReportServerController.php

    public function fetch()
    {
        $reportservers= ReportServer::all();
---
select * from `report_servers`

    public function index()
    {
        $reportservers = ReportServerResource::collection(ReportServer::all());
---
select * from `report_servers`