app/Models/FormatRule/FormatTextColor.php

    public static function createNew(): FormatTextColor {
        return FormatTextColor::create();
---
insert into `format_text_colors` (`status_id`, `uuid`, `updated_at`, `created_at`) values (1, '\"98f4af38-6f2b-4997-b093-c8be8beb1639\"', '2023-04-17 21:26:31', '2023-04-17 21:26:31')