app/Models/FormatRule/FormatRule.php

insert into `format_rules` (`num_ord`, `title`, `rule_result`, `description`, `innerformatrule_id`, `innerformatrule_type`, `status_id`, `uuid`, `updated_at`, `created_at`) values (1, 'red colored', 'allways', '', 2, 'App\Models\FormatRule\FormatTextColor', 1, '\"98f4af38-a8f2-42eb-b7dc-c16fec17e0fb\"', '2023-04-17 21:26:31', '2023-04-17 21:26:31')
update `format_rules` set `format_rule_type_id` = 1, `format_rules`.`updated_at` = '2023-04-17 21:26:31' where `id` = 214
---
    public static function createNew(Model|FormatRuleType $formatruletype, string $title, IInnerFormatRule|string $innerformatrule = null, string $rule_result = null, Status $status = null, string $description = null, int $num_ord = null)
    {
        $newinnerformatrule = self::createInnerFormatRule($formatruletype);
        $newinnerformatrule->updateOne($innerformatrule);

        $formatrule = $newinnerformatrule->formatrule()->create([
            'num_ord' => $num_ord,
            'title' => $title,
            'rule_result' => $rule_result ?? RuleResultEnum::ALLWAYS,
            'description' => $description,
        ]);

        $formatrule->formatruletype()->associate($formatruletype);

        if ( ! is_null($status) ) $formatrule->status()->associate($status);

        $formatrule->save();