app/Http/Controllers/Reports/ReportController.php

    public function index()
    {
        //dd(ReportResource::collection(Report::all()));
        $statuses = Status::all();
        $reporttypes = ReportType::all();
---
select * from `statuses`
select * from `report_types`

    public function reportfiles($uuid)
    {
        $report = Report::where('uuid', $uuid)->first();
---
select * from `reports` where `uuid` = '98c79898-1905-4907-a7a2-c6aeb031f47e' limit 1

    public function attributes($uuid)
    {
        $report = Report::where('uuid', $uuid)->first();
---
select * from `reports` where `uuid` = '99084ef2-ab56-4e89-a409-1041178160cc' limit 1