app/Http/Controllers/Reports/ReportTypeController.php

select * from `report_types`
---
    public function fetchall() {
        return ReportTypeResource::collection(ReportType::all());