app/Http/Requests/AnalysisRule/StoreAnalysisRuleRequest.php

    protected function prepareForValidation()
    {
        $this->merge([
            'status' => $this->setRelevantStatus($this->input('status'),'code', false),
            'model' => $this->input('model_type')::where('id', $this->input('model_id'))->first(),
            'rule_result_for_notification' => (is_null($this->input('rule_result_for_notification'))) ? null : $this->input('rule_result_for_notification')['value'],
            'analysisruletype' => $this->setAnalysisRuleType($this->input('analysisruletype'), 'id'),
        ]);
---
select * from `statuses` where `statuses`.`id` in (1)