app/Models/RetrieveAction/SelectedRetrieveAction.php

    public function updateOne(RetrieveAction $retrieveaction, string $code = null, Status $status = null, string $description = null): SelectedRetrieveAction
    {
        $this->code = $code;
        $this->description = $description;

        $this->status()->associate( is_null($status) ? Status::default()->first() : $status );
---
select * from `statuses` where `statuses`.`id` in (1)

    public function addActionValue(string $label,string $type,$value): RetrieveActionValue
    {
        return RetrieveActionValue::createNew(
            $this,
            $label,
            $type,
            ($type === ValueTypeEnum::STRING->value ? $value : null),
            ($type === ValueTypeEnum::INT->value ? $value : null),
            ($type === ValueTypeEnum::DATETIME->value ? $value : null),
            Status::active()->first()
        );
---
select * from `retrieve_action_values` where `retrieve_action_values`.`selected_retrieve_action_id` in (1)