routes/breadcrumbs.php

select * from `reports` where `uuid` = '98f5b0c3-8817-43e0-b326-be354d83982f' limit 1
---
        ->push($report->title, route('reports.show', $report->uuid));
});
// Reports.dynamicattributes
Breadcrumbs::for('reports.dynamicattributes', function (Trail $trail, $uuid) {
    $report = Report::where('uuid',$uuid)->first();
    $trail->parent('reports.show', $report)
        ->push("Liste des Champs", route('reports.dynamicattributes', $report->uuid));
});