app/Traits/Request/RequestTraits.php

    public function setRelevantStatus($value, $field = 'íd', $json_decode_before = false) {
        if (is_null($value)) {
            return null;
        }
        if ($json_decode_before || is_string($value)) {
            $value = $this->decodeJsonField($value);
        }

        return $value ? Status::where($field, $value[$field])->first() : null;
---
select * from `statuses` where `code` = 'inactive' limit 1