app/Http/Controllers/FormatRule/FormatRuleTypeController.php

    public function fetchall() {
        return FormatRuleTypeResource::collection(FormatRuleType::all());
---
select * from `format_rule_types`