app/Models/AnalysisRuleThreshold/AnalysisRuleThreshold.php

insert into `analysis_rule_thresholds` (`innerthreshold_id`, `innerthreshold_type`, `status_id`, `uuid`, `updated_at`, `created_at`) values (1, 'App\Models\AnalysisRuleThreshold\ThresholdMax', 1, '\"98f3a93b-f6cf-4ff4-8fe7-e57e5412be32\"', '2023-04-17 09:13:57', '2023-04-17 09:13:57')
update `analysis_rule_thresholds` set `threshold_type_id` = 2, `analysis_rule_thresholds`.`updated_at` = '2023-04-17 09:13:57' where `id` = 1
---
    public static function createNew(): AnalysisRuleThreshold {

        $default_treshold_type = ThresholdType::getDefault();
        $innerthreshold = self::createInnerThreshold($default_treshold_type);

        $innerrule = $innerthreshold->analysisrulethreshold()->create();

        $innerrule->thresholdtype()->associate($default_treshold_type);
        $innerrule->save();