app/Models/AnalysisRuleThreshold/ThresholdMax.php

    public static function createNew(array $attributes = []): ThresholdMax
    {
        if ( empty($attributes) ) {
            return ThresholdMax::create();
---
insert into `threshold_maxes` (`status_id`, `uuid`, `updated_at`, `created_at`) values (1, '\"98f3a93b-8eb1-4a9a-ba5a-ddc701f911f1\"', '2023-04-17 09:13:57', '2023-04-17 09:13:57')