app/Http/Requests/FormatRule/StoreFormatRuleRequest.php

select * from `statuses` where `statuses`.`id` in (1)
---
    protected function prepareForValidation()
    {
        $this->merge([
            'status' => $this->setRelevantStatus($this->input('status'), "íd", false),
            'model' => $this->input('model_type')::find($this->input('model_id'))->first(),
            'formatruletype' => $this->getRelevantModel(FormatRuleType::class, $this->input('formatruletype'), 'id'),
        ]);