app/Traits/FormatRule/HasFormatRules.php

update `format_rules` set `hasformatrule_id` = 1, `hasformatrule_type` = 'App\Models\AnalysisRule\AnalysisRule', `format_rules`.`updated_at` = '2023-04-17 21:26:31' where `id` = 214
---
    public function addFormatRule(Model|FormatRuleType $formatruletype, string $title, IInnerFormatRule|string $innerformatrule = null, string $rule_result = null, Status $status = null, string $description = null): FormatRule
    {
        $num_ord = $this->formatrules()->count() + 1;       // set the format rule number order
        $formatrule = FormatRule::createNew(
            $formatruletype,
            $title,
            $innerformatrule,
            $rule_result,
            $status,
            $description,
            $num_ord
        );                                                  // create new FormatRule + InnerFormatRule
        $this->formatrules()->save($formatrule);            // attach the new FormatRule to the current model object

        $formatrule->save();                                // save the association from the FormatRule