app/Http/Controllers/DynamicAttributes/DynamicAttributeTypeController.php

    public function fetchall() {
        return DynamicAttributeTypeResource::collection(DynamicAttributeType::all());
---
select * from `dynamic_attribute_types`