app/Models/AnalysisRule/AnalysisRule.php

insert into `analysis_rules` (`title`, `description`, `rule_result_for_notification`, `num_ord`, `inneranalysisrule_id`, `inneranalysisrule_type`, `status_id`, `uuid`, `updated_at`, `created_at`) values ('just test', 'test desc.', 'allways', 2, 1, 'App\Models\AnalysisRuleThreshold\AnalysisRuleThreshold', 1, '\"98f3a93c-344e-4d43-965b-d76ec5c5609e\"', '2023-04-17 09:13:57', '2023-04-17 09:13:57')
update `analysis_rules` set `analysis_rule_type_id` = 1, `analysis_rules`.`updated_at` = '2023-04-17 09:13:57' where `id` = 2
---
    public static function createNew(Model|AnalysisRuleType $analysisruletype, string $title, string $rule_result_for_notification = null, array $inneranalysisrule_attributes = [], Status $status = null, string $description = null, int $num_ord = null): AnalysisRule
    {
        $inneranalysisrule = self::createInnerRule($analysisruletype);
        $inneranalysisrule->updateOne($inneranalysisrule_attributes);

        $data = [
            'title' => $title,
            'description' => $description,
        ];
        if ( ! is_null($rule_result_for_notification) ) $data['rule_result_for_notification'] = $rule_result_for_notification;
        if ( ! is_null($num_ord) ) $data['num_ord'] = $num_ord;

        $analysisrule = $inneranalysisrule->analysisrule()->create($data);

        //$analysisrule->dynamicattribute()->associate($dynamicattribute);
        $analysisrule->analysisruletype()->associate($analysisruletype);

        $analysisrule->status()->associate( $status ?? Status::default()->first() );

        $analysisrule->save();