app/Http/Controllers/Access/AccessProtocoleController.php

select * from `access_protocoles`
---
    public function fetch()
    {
        $accessprotocoles = AccessProtocole::all();