app/Http/Controllers/Access/AccessAccountController.php

select * from `access_accounts`
---
    public function fetch()
    {
        $accessaccounts = AccessAccount::all();

select * from `access_accounts`
---
    public function index()
    {
        $accessaccounts = AccessAccountResource::collection(AccessAccount::all());