app/Http/Controllers/AnalysisRules/AnalysisRuleController.php

    public function destroy(AnalysisRule $analysisrule)
    {
        $analysisrule->delete();
---
delete from `analysis_rules` where `id` = 3