app/Http/Controllers/AnalysisRules/AnalysisRuleTypeController.php

select * from `analysis_rule_types`
---
    public function fetchall() {
        return AnalysisRuleTypeResource::collection(AnalysisRuleType::all());