app/Http/Controllers/AnalysisRules/ThresholdTypeController.php

    public function fetchall() {
        return ThresholdTypeResource::collection(ThresholdType::all());
---
select * from `threshold_types`