app/Http/Controllers/Reportsetting/ReportsettingController.php

select * from `file_mime_types`
select * from `file_mime_types` where `file_mime_types`.`id` in (4)
select * from `report_file_types`
select * from `access_protocoles`
select * from `os_servers`
---
    public function index()
    {
        $filemimetypes = FileMimetype::all();
        $reportfiletypes = ReportFileType::all()->load('filemimetype');
        $accessprotocoles = AccessProtocole::all();
        $osservers = OsServer::all();