app/Http/Controllers/Authorization/RoleController.php

    public function index(Request $request)
    {
        $roles = Role::all();
        $roles->load(['permissions']);
---
select * from `roles`
select `permissions`.*, `role_has_permissions`.`role_id` as `pivot_role_id`, `role_has_permissions`.`permission_id` as `pivot_permission_id` from `permissions` inner join `role_has_permissions` on `permissions`.`id` = `role_has_permissions`.`permission_id` where `role_has_permissions`.`role_id` in (1, 2)