app/Traits/AnalysisRules/HasAnalysisRules.php

update `analysis_rules` set `hasanalysisrule_id` = 2, `hasanalysisrule_type` = 'App\Models\DynamicAttributes\DynamicAttribute', `analysis_rules`.`updated_at` = '2023-04-17 09:13:57' where `id` = 2
---
    public function addAnalysisRule(Model|AnalysisRuleType $analysisruletype, string $title, array $inneranalysisrule_attributes = [], string $rule_result_for_notification = null, Status $status = null, string $description = null): AnalysisRule
    {
        $num_ord = $this->analysisrules()->count() + 1;     // set the analysis rule number order
        $analysisrule = AnalysisRule::createNew(
            $analysisruletype,
            $title,
            $rule_result_for_notification,
            $inneranalysisrule_attributes,
            $status,
            $description,
            $num_ord
        );                                                  // create new AnalysisRule + IInnerAnalysisRule
        $this->analysisrules()->save($analysisrule);        // attach the new AnalysisRule to the current model object