app/Http/Controllers/ReportTreatments/ReportTreatmentResultController.php

    public function index()
    {
        $reporttreatmentresults = ReportTreatmentResultResource::collection(ReportTreatmentResult::all());
---
select * from `report_treatment_results`