app/Http/Controllers/AccessAccountController.php

    public function fetch()
    {
        $accessaccounts = AccessAccount::all();
---
select * from `access_accounts`

    public function index()
    {
        $accessaccounts = AccessAccount::all();
---
select * from `access_accounts`