app/Http/Requests/SelectedRetrieveAction/StoreSelectedRetrieveActionRequest.php

    protected function prepareForValidation()
    {
        $this->merge([
            'status' => $this->setRelevantStatus($this->input('status'),'code', false),
            'model' => $this->input('model_type')::find($this->input('model_id'))->first(),
            'actionvalue_valuetype' => (is_null($this->input('actionvalue_valuetype'))) ? null : $this->input('actionvalue_valuetype')['value'],
            'retrieveaction' => $this->setRelevantRetrieveAction(RetrieveAction::class, $this->input('retrieveaction'),'code', false),
        ]);
---
select * from `statuses` where `statuses`.`id` in (1)