app/Models/AccessAccount.php

insert into `access_accounts` (`login`, `pwd`, `email`, `username`, `description`, `status_id`, `uuid`, `updated_at`, `created_at`) values ('dfdfdfdf', 'dfddff', 'admin@sheundani.net', 'fddfdfdf', 'dffdffdfdf', 1, '\"98af4f6f-b3b7-422d-8f58-9ef473f83d59\"', '2023-03-14 09:46:34', '2023-03-14 09:46:34')
update `access_accounts` set `status_id` = 2, `access_accounts`.`updated_at` = '2023-03-14 10:06:19' where `id` = 5
---
    public static function createNew($login, $pwd, $email, $username, Status $status = null, $description = null): AccessAccount
    {
        $status = is_null($status) ? Status::default()->first() : $status;

        $accessaccount = AccessAccount::create([
            'login' => $login,
            'pwd' => $pwd,
            'email' => $email,
            'username' => $username,
            'description' => $description,
        ]);

        $accessaccount->status()->associate($status)->save();