app/Models/AnalysisRules/AnalysisHighlight.php

    public static function createNew(AnalysisRule $analysisrule, AnalysisHighlightType $highlighttype, $title, $when_rule_result_is, $description)
    {
        $innerhighlight = self::createInnerHighlight($highlighttype);

        $analysishighlight = $innerhighlight->analysishighlight()->create([
            'title' => $title,
            'when_rule_result_is' => $when_rule_result_is,
            'description' => $description,
        ]);

        $analysishighlight->analysisrule()->associate($analysisrule);
        $analysishighlight->highlighttype()->associate($highlighttype);

        $analysishighlight->save();
---
insert into `analysis_highlights` (`title`, `when_rule_result_is`, `description`, `innerhighlight_id`, `innerhighlight_type`, `status_id`, `uuid`, `updated_at`, `created_at`) values (',bb,', 'allowed', 'bbbbb', 1, 'App\Models\AnalysisRules\HighlightTextSize', 1, '\"98b5d391-5a14-4afe-80f5-a6b3a662af02\"', '2023-03-17 15:31:00', '2023-03-17 15:31:00')
update `analysis_highlights` set `analysis_rule_id` = 1, `analysis_highlight_type_id` = 2, `analysis_highlights`.`updated_at` = '2023-03-17 15:31:00' where `id` = 1