app/Models/AnalysisRules/HighlightTextSize.php

    public static function createNew(): HighlightTextSize {

        $innerhighlight = HighlightTextSize::create();
---
insert into `highlight_text_sizes` (`status_id`, `uuid`, `updated_at`, `created_at`) values (1, '\"98b5d391-2303-4afa-b5ca-1ffc7782291e\"', '2023-03-17 15:31:00', '2023-03-17 15:31:00')