app/Models/Treatments/Treatment/RawTreatment.php

    public static function getById(int|null $id): ?Treatment {
        if ( is_null($id) ) {
            return null;
        }
        return Treatment::find($id);
---
select * from `treatments` where `treatments`.`id` = 3 limit 1