app/Http/Controllers/RetrieveAction/RetrieveActionController.php

    public function fetch(): AnonymousResourceCollection
    {
        $retrieveactions = RetrieveAction::all();
---
select * from `retrieve_actions`