app/Http/Controllers/RetrieveAction/RetrieveActionTypeController.php

select * from `retrieve_action_types`
---
    public function fetch(): AnonymousResourceCollection
    {
        $retrieveactiontypes = RetrieveActionType::all();