app/Http/Controllers/ReportFile/FileMimeTypeController.php

    public function fetch() {
        return FileMimeType::all();
---
select * from `file_mime_types`