app/Http/Controllers/ReportFile/ReportFileAccessController.php

select * from `report_file_accesses` limit 1
---
    public function download() {
        $reportfileaccess = ReportFileAccess::first();