app/Http/Controllers/ReportFile/ReportFileTypeController.php

    public function fetch()
    {
        $reportfiletypes = ReportFileType::all();
---
select * from `report_file_types`